cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
#tap 'homebrew/completions'
#tap 'homebrew/php'
#tap 'homebrew/versions'
tap 'buo/cask-upgrade'

brew 'brew-cask-completion'
brew 'coreutils'
brew 'cmatrix'
brew 'cmake'
brew 'clang-format'
brew 'duti'
brew 'findutils', args: ['with-default-names']
brew 'fish'
brew 'gdb'
brew 'git'
brew 'mas'
brew 'mysql'
brew 'node'
brew 'openssl'
brew 'tig'
brew 'trash'
brew 'sl'
brew 'tmux'
brew 'wget'
brew 'valgrind'
brew 'vim'

cask 'avibrazil-rdm'
cask 'google-backup-and-sync'
cask 'iterm2'
cask 'java'
cask 'p4merge'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'unity'
cask 'unity-monodevelop'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoomus'
cask 'microsoft-teams'
cask 'adobe-creative-cloud'
cask 'figma'
cask 'discord'
cask './casks/shearwater-cloud.rb'

mas '1Password', id: 443987910
mas 'Xcode', id: 497799835
mas 'Amphetamine', id: 937984704
mas 'Slack', id: 803453959
mas 'Sentry Viewer', id: 1485943859
mas 'Messenger', id: 1480068668
