cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
#tap 'homebrew/completions'
#tap 'homebrew/php'
#tap 'homebrew/versions'
tap 'buo/cask-upgrade'

brew 'brew-cask-completion'
brew 'coreutils'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'
brew 'grep'
brew 'cmatrix'
brew 'cmake'
brew 'clang-format'
brew 'duti'
brew 'fish'
brew 'gdb'
brew 'git'
brew 'mas'
brew 'mysql'
brew 'node'
brew 'openssl'
brew 'tig'
brew 'trash'
brew 'sl'
brew 'tmux'
brew 'wget'
#brew 'valgrind'
brew 'vim'
brew 'defaultbrowser'

cask 'avibrazil-rdm'
cask 'google-chrome'
#cask 'google-backup-and-sync'
cask 'iterm2'
#cask 'java'
#cask 'p4merge'
cask 'slack'
cask 'spotify'
cask 'steam'
#cask 'unity'
#cask 'unity-monodevelop'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoomus'
cask 'microsoft-teams'
cask 'adobe-creative-cloud'
cask 'figma'
cask 'discord'
cask './casks/shearwater-cloud.rb'
cask './casks/topnotch.rb'
cask 'visual-studio-code'

mas '1Password', id: 443987910
mas 'Xcode', id: 497799835
mas 'Amphetamine', id: 937984704
mas 'Slack', id: 803453959
mas 'Sentry Viewer', id: 1485943859
mas 'Messenger', id: 1480068668
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Telegram', id: 747648890

