cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
#tap 'homebrew/completions'
#tap 'homebrew/php'
#tap 'homebrew/versions'
tap 'buo/cask-upgrade'

brew 'brew-cask-completion'
brew 'coreutils'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'
brew 'grep'
brew 'cmatrix'
brew 'cmake'
brew 'clang-format'
brew 'duti'
brew 'gdb'
brew 'git'
brew 'mas'
brew 'mysql'
brew 'node'
brew 'openssl'
brew 'tig'
brew 'trash'
brew 'sl'
brew 'tmux'
brew 'wget'
#brew 'valgrind'
brew 'vim'
brew 'defaultbrowser'
brew 'fzf'
brew 'ripgrep-all'
brew 'pyenv'
brew 'clipbook'
brew 'cursor'

cask 'avibrazil-rdm'
cask 'arc'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
#cask 'java'
#cask 'p4merge'
#cask 'slack'
cask 'spotify'
cask 'steam'
#cask 'unity'
#cask 'unity-monodevelop'
cask 'vlc'
cask 'zoom'
#cask 'microsoft-teams'
cask 'adobe-creative-cloud'
#cask 'figma'
cask 'discord'
cask './casks/shearwater-cloud.rb'
cask './casks/topnotch.rb'
cask 'visual-studio-code'
cask '1password'
cask 'rocket'
cask 'imhex'
cask 'rekordbox'

mas 'Xcode', id: 497799835
mas 'Amphetamine', id: 937984704
mas 'Slack', id: 803453959
#mas 'Sentry Viewer', id: 1485943859
mas 'Messenger', id: 1480068668
mas 'Windows App', id: 1295203466
mas 'Telegram', id: 747648890
mas 'Save to Raindrop.io', id: 1549370672
mas '1Blocker', id: 1365531024
mas 'Microsoft OneNote', id: 784801555
mas '1Password for Safari', id: 1569813296
mas 'Shareful', id: 1522267256
mas 'Flighty', id: 1358823008
#mas 'Notchmeister', id: 1599169747 # god this is stupid
mas 'Slack', id: 803453959

